Autodesk.Revit.DB.Structure.RebarShapeParameters.GetAllRebarShapeParameters(Autodesk.Revit.DB.Document)
List all shape parameters used by all the existing RebarShapes in the specified document.
Remarks:
This method replaces RebarShape.GetAllRebarShapeParameters() from prior releases.
doc:
The document.
Returns:
ElementIds corresponding to the external parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeParameters.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeParameters.GetExternalDefinitionForElementId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.DefinitionFile)
Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter
in a document.
Returns:
The external parameter corresponding to the parameter's ElementId,
or null if the Id does not correspond to an external parameter,
or the parameter is not in the definition file.
doc: A document.
paramId: The id of a shared parameter in the document.
definitionFile: A database of shared parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null.

Autodesk.Revit.DB.Structure.RebarShapeParameters.GetOrCreateElementIdForExternalDefinition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalDefinition)
Retrieve the ElementId corresponding to an external rebar shape parameter
in the document, if it exists; otherwise, add the parameter to the document
and generate a new ElementId.
Remarks:
Before a parameter can be used in a RebarShapeDefinition, it must
exist in the definition's document. There are two ways to achieve this.
It can be bound to one or more categories in the document using
the Document.ParameterBindings property, or it can be created with this
method.
Returns:
An ElementId representing the shared parameter stored in the document.
doc: A document.
externalDefinition: A shared parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null.

Autodesk.Revit.DB.Structure.RebarShapeParameters.GetElementIdForExternalDefinition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalDefinition)
Retrieve the ElementId corresponding to an external rebar shape parameter
in the document, if it exists; otherwise, return InvalidElementId.
Remarks:
Before a parameter can be used in a RebarShapeDefinition, it must
exist in the definition's document. There are two ways to achieve this.
It can be bound to one or more categories in the document using
the Document.ParameterBindings property, or it can be created by
calling RebarShapeParameters.GetOrCreateElementIdForExternalDefinition().
Returns:
An ElementId representing the shared parameter stored in the document,
or InvalidElementId if the parameter is not stored in the document.
doc: A document.
externalDefinition: A shared parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null.

Autodesk.Revit.DB.Structure.RebarShapeParameters.IsValidExternalDefinition(Autodesk.Revit.DB.ExternalDefinition)
Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
Remarks:
A Rebar Shape parameter must be an ExternalDefinition with a ParameterType of Length.
param:
Definition of a shared parameter.
Returns:
True if the definition is of type Length, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeParameters
Class containing functions that create and retrieve shared parameters for RebarShapes.
Since:
2012